У каждого ученика должны быть указаны, фамилия, имя,  день рождения и адрес проживания
SELECT *
FROM Student
WHERE first_name IS NULL OR middle_name IS NULL OR last_name IS NULL OR birthday IS NULL OR address IS NULL;
 не пройдена
	id	first_name	middle_name	last_name	birthday	address
1	52	Stanislav	<NULL>	Lazarev	2002-06-04T00:00:00.000Z	ul. Internacionalnaya, d. 6, kv. 9
2	64	Kirill	<NULL>	SHubin	2003-06-16T00:00:00.000Z	ul. Zapadnaya, d. 6, kv. 3
3	85	Elizaveta	<NULL>	Fadeeva	2001-11-01T00:00:00.000Z	ul. Zapadnaya, d. 7, kv. 19
===============================================================================================================
Каждый ученик должен быть прикреплен к классу
SELECT *
FROM Student s
WHERE NOT EXISTS (
    SELECT 1
    FROM Student_in_class sic
    WHERE s.id = sic.student);
    не пройдена
    	id	first_name	middle_name	last_name	birthday	address
    1	85	Elizaveta	<NULL>	Fadeeva	2001-11-01T00:00:00.000Z	ul. Zapadnaya, d. 7, kv. 19
===========================================================================================================
У каждого преподавателя должны быть указаны Фамилия и имя
SELECT id, first_name, last_name
FROM Teacher
WHERE first_name IS NULL OR last_name IS NULL;
проверка пройдена
===========================================================================================================
У каждого класса должно указываться буквенное распределение(их три A B C)
SELECT *
FROM class
WHERE name NOT LIKE '%A' AND name NOT LIKE '%B' AND name NOT LIKE '%C';
проверка пройдена
===============================================================================================================
В учебном заведении стандартная форма обучения 11 классов
SELECT *
FROM class
WHERE CAST(name As UNSIGNED)> 11;
проверка пройдена в школе нет > 11 класса
====================================================================================================================
В каждом классе, должно быть хотябы 10 учеников
SELECT class, COUNT(student) AS students_count
FROM Student_in_class
GROUP BY class;
проверна не пройдена с 1 - 5 классах <10 учащихся
	class	students_count
1	9	13
2	8	11
3	7	10
4	6	11
5	5	8
6	4	9
7	3	8
8	2	7
9	1	7
====================================================================================================================
В учебном заведении есть всего несколько классных комнат(11,12,13,15,17,21,23,29,35,44,45)
select classroom
from Schedule
WHERE classroom not in(11,12,13,15,17,21,23,29,35,44,45);
проверка не пройдена запрос вернул множество комнат с другими номерами привожу не всю таблицу
	classroom
1	47
2	34
3	36
4	37
5	38
================================================================================================================
Имя преподавателя указывается только в английской раскладке(Ivan)
Отчество преподавателя указывается только в английской раскладке(Petrovich)
Фамилия преподавателя указывается только в английской раскладке(Sidorov)
SELECT id, first_name, middle_name, last_name
FROM Teacher
WHERE NOT (first_name REGEXP '^[A-Za-z]+$' AND middle_name REGEXP '^[A-Za-z]+$' AND last_name REGEXP '^[A-Za-z]+$');
тест полу пройден на мой вкус, не смотря на то что запрос вернул 1 строчку далее привожу далее
	id	first_name	middle_name	 last_name
1	14	Vasil'ev	Vasilij	     Vasil'evich
===================================================================================================================
Название предмета указывается только в английской раскладке(Biology)
SELECT id, name
FROM Subject
WHERE name NOT REGEXP '^[A-Za-z ]+$';
проверка пройдена
================================================================================================================
Время в формате Time(HH:MM), дата старта раньше чем дата окончания
Время в формате Time(HH:MM), дата окончания позже чем дата старта
SELECT id, start_pair, end_pair
FROM Timepair
WHERE TIME_FORMAT(start_pair, '%H:%i') != start_pair
   OR TIME_FORMAT(end_pair, '%H:%i') != end_pair;
   	id	start_pair	end_pair
   1	1	08:30:00	09:15:00
   2	2	09:20:00	10:05:00
   3	3	10:15:00	11:00:00
   4	4	11:05:00	11:50:00
   5	5	12:50:00	13:35:00
   6	6	13:40:00	14:25:00
   7	7	14:35:00	15:20:00
   8	8	15:25:00	16:10:00
   если нужно строго без секунд тогда проверка не прошла
=====================================================================================================================
Номер класса указывается только в английской раскладке(1 A, 2 B, 3 C)
SELECT id, name
FROM Class
WHERE name NOT REGEXP '^[0-9]+ [A-Z]$';
проверка пройдена
======================================================================================================================
Имя ученика указывается только в английской раскладке(Ivan)
Отчество ученика указывается только в английской раскладке(Petrovich)
Фамилия ученика указывается только в английской раскладке(Sidorov)
SELECT id, first_name, middle_name, last_name
FROM Student
WHERE NOT (first_name REGEXP '^[A-Za-z]+$' AND middle_name REGEXP '^[A-Za-z]+$' AND last_name REGEXP '^[A-Za-z]+$');
все проверки пройдены
==================================================================================================================
Дата рождения в формате Date(YYYY-MM-DD)
в MySQL происходит автоматическая проверка формата Date => доп проверок не нужно
=====================================================================================================================
Адрес проживания указывается только в английской раскладке(ul. Litkina, d. 18, k. 838)
SELECT id, address
FROM Student
WHERE address NOT REGEXP '^[A-Za-z0-9,\\.\\s]+$';
проверка пройдена
==================================================================================================================
Дата в формате Date (YYYY-MM-DD)
в MySQL происходит автоматическая проверка формата Date => доп проверок не нужно
=============================================================================================================
Номер кабинета в формате int (25, 29, 13)
тип INT автоматически проверит и не даст ввести в строку не число.
можно сделать запрос для проверки типа столбца
DESCRIBE Schedule classroom;
	Field	    Type	  Null	Key	Default	Extra
1	classroom	int	      YES		<NULL>
тут видим что можно передать null тогда делаем проверку что нету в строках null
select classroom
FROM Schedule
WHERE classroom is null;
проверка пройдена
=============================================================================================================